app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `crypted_password`, `updated_at`, `username`, `password_salt`, `persistence_token`, `email`) VALUES('2011-01-04 23:38:47', 'fbb715d2983c3e330e83e31df4b7e1fad77ce7f4b221d6969e331364ef76288d6e5b8a09978f3239da7ea6bc5e80675f4fc7dab3d865db5ead8915e767cfae98', '2011-01-04 23:38:47', 'proc', 'IvFilFjUhYZlEbIln4x', '36f1d2972a03046b2e26e89ce8e085fc81818afb7d3a81fff61a915f862ce8aea7fb77bd8972c0b2e71e09c85393b36f979bd7e6f502993504678827110ca62d', 'proc.com@gmail.com')
---
 def create
  @user = User.new(params[:user])
  if @user.save